Tekla Open API Reference for Tekla Structures 2025
DetailMarkTagsAttributes Class
 The DetailMarkTagsAttributes class contains attributes for detail mark tags.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.DetailMarkTagsAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class DetailMarkTagsAttributes : GenericAttributesBase
<SerializableAttribute>
Public NotInheritable Class DetailMarkTagsAttributes
	Inherits GenericAttributesBase
The DetailMarkTagsAttributes type exposes the following members.
Constructors
Name | Description
DetailMarkTagsAttributes()
 Creates a new mark tags attributes instance.
DetailMarkTagsAttributes(ViewMarkBasicTagAttributes, ViewMarkBasicTagAttributes, ViewMarkBasicTagAttributes, ViewMarkBasicTagAttributes, ViewMarkBasicTagAttributes)
 Creates a new mark tags attributes instance.
Top
Properties
Name | Description
TagA1
 The tag A1 of a mark.
TagA2
 The tag A2 of a mark.
TagA3
 The tag A3 of a mark.
TagA4
 The tag A4 of a mark.
TagA5
 The tag A5 of a mark.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace